src/main/resources/xml/accommodationBatchComponentWSPort/updateProcessStatusList/updateProcessStatusList.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:bat="http://batch.accommodation.transferobject.booking.dreams.wdw.com">
   <soapenv:Header/>
   <soapenv:Body>
      <bat:updateProcessStatus>
         <!--Optional:-->
         <processDataId>?</processDataId>
         <!--Optional:-->
         <processType>?</processType>
         <!--Optional:-->
         <context>
            <addressRole>?</addressRole>
            <conversationId>?</conversationId>
            <messageId>?</messageId>
            <party1Id>?</party1Id>
            <party1Type>?</party1Type>
            <party2Id>?</party2Id>
            <party2Type>?</party2Type>
            <pathHostName>?</pathHostName>
            <pathId>?</pathId>
            <principalId>?</principalId>
            <principalMethod>?</principalMethod>
            <principalRole>?</principalRole>
            <principalUri>?</principalUri>
            <principalValue>?</principalValue>
            <requestTimeStamp>?</requestTimeStamp>
            <toAddressRole>?</toAddressRole>
            <userName>?</userName>
         </context>
      </bat:updateProcessStatus>
   </soapenv:Body>
</soapenv:Envelope>